In [1]:
import pandas as pd

In [2]:
series = {
    "colores": ["rojo", "naranja", "verde", "amarillo"],
    "frutas": ["manzana", "mandarina", "kiwi", "pina"]
}

In [3]:
pd.Series(series)

colores    [rojo, naranja, verde, amarillo]
frutas     [manzana, mandarina, kiwi, pina]
dtype: object

In [4]:
pd.Series(
    ["rojo", "naranja", "verde", "amarillo"],
    name="colores",
    index=["manzana", "mandarina", "kiwi", "pina"],
)

manzana          rojo
mandarina     naranja
kiwi            verde
pina         amarillo
Name: colores, dtype: object

In [5]:
pd.Series(
    ["rojo", "naranja", "verde", "amarillo"],
    name="colores",
)

0        rojo
1     naranja
2       verde
3    amarillo
Name: colores, dtype: object

In [6]:
pd.Series(
    ["rojo", "naranja", "verde", "amarillo"]
)

0        rojo
1     naranja
2       verde
3    amarillo
dtype: object

In [7]:
pd.Series(
    ["rojo", "naranja", "verde", "amarillo"], dtype="string"
)

0        rojo
1     naranja
2       verde
3    amarillo
dtype: string

In [9]:
colores = pd.Series(["rojo", "naranja", "verde", "amarillo"], name="colores")
frutas = pd.Series(["manzana", "mandarina", "kiwi", "pina"], name="frutas")

In [10]:
colores

0        rojo
1     naranja
2       verde
3    amarillo
Name: colores, dtype: object

In [11]:
frutas

0      manzana
1    mandarina
2         kiwi
3         pina
Name: frutas, dtype: object

In [12]:
frutas_df = frutas.to_frame()
frutas_df

      frutas
0    manzana
1  mandarina
2       kiwi
3       pina

In [13]:
frutas_df["colores"] = colores
frutas_df

      frutas   colores
0    manzana      rojo
1  mandarina   naranja
2       kiwi     verde
3       pina  amarillo

In [14]:
frutas_df["cantidad"] = [3, 5, 6, 9]
frutas_df

      frutas   colores  cantidad
0    manzana      rojo         3
1  mandarina   naranja         5
2       kiwi     verde         6
3       pina  amarillo         9

In [15]:
frutas_df["cantidad"]

0    3
1    5
2    6
3    9
Name: cantidad, dtype: int64

In [16]:
frutas_df[["cantidad"]]

   cantidad
0         3
1         5
2         6
3         9

In [17]:
frutas_df[["frutas", "cantidad"]]

      frutas  cantidad
0    manzana         3
1  mandarina         5
2       kiwi         6
3       pina         9

In [18]:
series = pd.Series(range(1000000), name="naturales")
series.head()

0    0
1    1
2    2
3    3
4    4
Name: naturales, dtype: int64

In [19]:
%%timeit
series.mul(2)

253 μs ± 7.07 μs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [20]:
%%timeit
for i in series:
    i * 2

55 ms ± 460 μs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [21]:
pd.Series(range(5), dtype="int64")

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [22]:
pd.Series(range(5), dtype="float64")

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [23]:
pd.Series([True, False, True, False, True], dtype="bool")

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [24]:
pd.Series(["manzana", "mandarina", "kiwi", "pina"], dtype="string")

0      manzana
1    mandarina
2         kiwi
3         pina
dtype: string

In [25]:
pd.Series(["2025-02-01", "2025-02-02", "2025-02-03", "2025-02-04", "2025-02-05"], dtype="datetime64[ns]")

0   2025-02-01
1   2025-02-02
2   2025-02-03
3   2025-02-04
4   2025-02-05
dtype: datetime64[ns]

In [27]:
pd.Series(["camisa", "pantalon", "medias", "zapatos", "zapatos"], dtype="category")

0      camisa
1    pantalon
2      medias
3     zapatos
4     zapatos
dtype: category
Categories (4, object): ['camisa', 'medias', 'pantalon', 'zapatos']

In [28]:
import numpy as np

np.nan

nan

In [29]:
pd.Series([1, 2, 3, np.nan, 4, 5])

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    5.0
dtype: float64

In [34]:
pd.Series(["manzana", "mandarina", np.nan, "pina"])

0      manzana
1    mandarina
2          NaN
3         pina
dtype: object

In [32]:
pd.Series(["manzana", "mandarina", "pina"], dtype="string[pyarrow]")

0      manzana
1    mandarina
2         pina
dtype: string

In [33]:
pd.Series([1, 2, 3, np.nan, 4, 5], dtype="int64[pyarrow]")

0       1
1       2
2       3
3    <NA>
4       4
5       5
dtype: int64[pyarrow]

In [35]:
series = pd.Series(["manzana", "mandarina", "kiwi", "pina", "guayaba", "fresa", "fresa", "pina", "manzana", "limon"], dtype="string")
series.head()

0      manzana
1    mandarina
2         kiwi
3         pina
4      guayaba
dtype: string

In [38]:
series == "manzana"

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9    False
dtype: boolean

In [44]:
mask = series == "manzana"

In [45]:
series[mask]

0    manzana
8    manzana
dtype: string

In [46]:
mask = (series == "manzana") | (series == "fresa")

In [47]:
series[mask]

0    manzana
5      fresa
6      fresa
8    manzana
dtype: string

In [48]:
mask = series != "manzana"
series[mask]

1    mandarina
2         kiwi
3         pina
4      guayaba
5        fresa
6        fresa
7         pina
9        limon
dtype: string

```
mayor: >
menor: <
igual: ==
distinto: !=
mayor o igual: >=
menor o igual: <=
```

In [49]:
series[0]

'manzana'

In [50]:
series.iloc[0]

'manzana'

In [51]:
series.iloc[0:3]

0      manzana
1    mandarina
2         kiwi
dtype: string

In [52]:
series.iloc[:3]

0      manzana
1    mandarina
2         kiwi
dtype: string

In [53]:
series.iloc[2:]

2       kiwi
3       pina
4    guayaba
5      fresa
6      fresa
7       pina
8    manzana
9      limon
dtype: string

In [54]:
series[::-1]

9        limon
8      manzana
7         pina
6        fresa
5        fresa
4      guayaba
3         pina
2         kiwi
1    mandarina
0      manzana
dtype: string

In [55]:
frutas_df

      frutas   colores  cantidad
0    manzana      rojo         3
1  mandarina   naranja         5
2       kiwi     verde         6
3       pina  amarillo         9

In [57]:
frutas_df.index = frutas_df["frutas"]
frutas_df.drop(columns="frutas", inplace=True)
frutas_df

            colores  cantidad
frutas
manzana        rojo         3
mandarina   naranja         5
kiwi          verde         6
pina       amarillo         9

In [58]:
frutas_df.loc["manzana"]

colores     rojo
cantidad       3
Name: manzana, dtype: object

In [59]:
frutas_df.loc[["manzana"]]

        colores  cantidad
frutas
manzana    rojo         3

In [60]:
frutas_df.loc["manzana":"kiwi"]

           colores  cantidad
frutas
manzana       rojo         3
mandarina  naranja         5
kiwi         verde         6